$(function () {
    echart_1();
    echart_3();

    //echart_1四中类型比例
    function echart_1() {
        // 基于准备好的dom，初始化echarts实例
        var myChart = echarts.init(document.getElementById('chart_1'));
        option = {
            tooltip: {
                trigger: 'item',
                formatter: " {a} <br/>{b} : {c} ({d}%)"
            },
            legend: {
                x: 'center',
                y: '15%',
                data: [ '低价值型', '大众型', '潜力型','高价值型'],
                icon: 'circle',
                textStyle: {
                    color: '#fff',
                }
            },
            calculable: true,
            series: [{
                name: '',
                type: 'pie',
                //起始角度，支持范围[0, 360]
                startAngle: 0,
                //饼图的半径，数组的第一项是内半径，第二项是外半径
                radius: [41, 100.75],
                //支持设置成百分比，设置成百分比时第一项是相对于容器宽度，第二项是相对于容器高度
                center: ['50%', '40%'],
                //是否展示成南丁格尔图，通过半径区分数据大小。可选择两种模式：
                // 'radius' 面积展现数据的百分比，半径展现数据的大小。
                //  'area' 所有扇区面积相同，仅通过半径展现数据大小
                roseType: 'area',
                //是否启用防止标签重叠策略，默认开启，圆环图这个例子中需要强制所有标签放在中心位置，可以将该值设为 false。
                avoidLabelOverlap: false,
                label: {
                    normal: {
                        show: true,
                        formatter: '{d}%'
                    },
                    emphasis: {
                        show: true
                    }
                },
                labelLine: {
                    normal: {
                        show: true,
                        length2: 1,
                    },
                    emphasis: {
                        show: true
                    }
                },
                data: [{
                        value: 11775,
                        name: '低价值型',
                        itemStyle: {
                            normal: {
                                color: '#f845f1'
                            }
                        }
                    },
                    {
                        value: 8240,
                        name: '大众型',
                        itemStyle: {
                            normal: {
                                color: '#ad46f3'
                            }
                        }
                    },
                    {
                        value: 1023,
                        name: '潜力型',
                        itemStyle: {
                            normal: {
                                color: '#5045f6'
                            }
                        }
                    },
                    {
                        value: 1180,
                        name: '高价值型',
                        itemStyle: {
                            normal: {
                                color: '#4777f5'
                            }
                        }
                    },


                    {
                        value: 0,
                        name: "",
                        itemStyle: {
                            normal: {
                                color: 'transparent'
                            }
                        },
                        label: {
                            show: false
                        },
                        labelLine: {
                            show: false
                        }
                    },
                    {
                        value: 0,
                        name: "",
                        itemStyle: {
                            normal: {
                                color: 'transparent'
                            }
                        },
                        label: {
                            show: false
                        },
                        labelLine: {
                            show: false
                        }
                    },
                    {
                        value: 0,
                        name: "",
                        itemStyle: {
                            normal: {
                                color: 'transparent'
                            }
                        },
                        label: {
                            show: false
                        },
                        labelLine: {
                            show: false
                        }
                    },
                    {
                        value: 0,
                        name: "",
                        itemStyle: {
                            normal: {
                                color: 'transparent'
                            }
                        },
                        label: {
                            show: false
                        },
                        labelLine: {
                            show: false
                        }
                    }
                ]
            }]
        };
        // 使用刚指定的配置项和数据显示图表。
        myChart.setOption(option);
        window.addEventListener("resize", function () {
            myChart.resize();
        });
    }
function echart_3() {
        // 基于准备好的dom，初始化echarts实例
        var myChart = echarts.init(document.getElementById('chart_3'));
        myChart.clear();
        var legendData = ['1720094', '1700206', '1711902', '1717608', '1703876'];

        var colors = ["#ffa74d", "#ff4848", "#f1de4f", "#6bafff","#76ff38"];
        var option = {
            // backgroundColor: '#0f375f',
            legend: {
                     top: '10%',
                show: true,
                left: "center",
                data: legendData,
                y: "5%",
                itemWidth: 18,
                itemHeight: 12,
                textStyle: {
                    color: "#6173A3",
                    fontSize: 14
                },
            },
            toolbox: {
                orient: 'vertical',
                right: '1%',
                top: '20%',
                iconStyle: {
                    // color: '#fff',
                    borderColor: '#fff'
                    // borderWidth: 1,
                },
                feature: {
                    saveAsImage: {},
                    magicType: {
                        // show: true,
                        type: ['line','bar']
                    }
                }
            },
            color: colors,
            grid: {
                top: '35%',
                left: '3%',
                right: '4%',
                bottom: '8%',
                containLabel: true
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: {
                    type: 'shadow'
                },
            },
            xAxis: [{
                splitLine: {
                    show: false
                },
                 type: 'time',
                axisLine: {
                    show: true,
                    lineStyle: {
                        color: '#6173A3'
                    }
                },
                axisLabel: {
                    interval: 0,
                    textStyle: {
                        color: '#9ea7c4',
                        fontSize: 12
                    }
                },
                axisTick: {
                    show: false
                }
            }, ],
            yAxis: [{
                axisTick: {
                    show: false
                },
                splitLine: {
                    show: false
                },
                axisLabel: {
                    textStyle: {
                        color: '#9ea7c4',
                        fontSize: 12
                    }
                },
                axisLine: {
                    show: true,
                    lineStyle: {
                        color: '#6173A3'
                    }
                },
            }, ],

            series: [
                {
                    // data:['019716', '011309', '007730', '004120', '012163'],
                    //data:['1720094', '1700206', '1711902', '1717608', '1703876'],
                    name:'1720094',
                    type:'line',
                    data:[['2020/01/27', '64372'], ['2020/02/24', '83080'], ['2020/03/02', '74272'], ['2020/04/08', '69201'], ['2020/07/05', '244199'], ['2020/08/15', '125156'], ['2020/11/29', '295300'], ['2020/12/24', '77408'], ['2021/01/23', '97585'], ['2021/03/09', '166131'], ['2021/04/30', '73070'], ['2021/06/28', '192954'], ['2021/08/12', '273431'], ['2021/10/24', '212287']]
                },
                {
                    name:'1700206',
                    type:'line',
                    data:[['2020/02/17', '112313'], ['2020/04/12', '53151'], ['2020/05/13', '74670'], ['2020/07/27', '277413'], ['2020/08/30', '104557'], ['2020/09/03', '89502'], ['2020/12/08', '319992'], ['2021/02/18', '110334'], ['2021/05/11', '281082'], ['2021/06/19', '123450'], ['2021/07/19', '69627'], ['2021/09/20', '87688'], ['2021/10/14', '111116'], ['2021/11/29', '76693']]

                },
                {
                    name:'1711902',
                    type:'line',
                    data:[['2020/02/15', '81266'], ['2020/04/21', '76594'], ['2020/05/27', '33407'], ['2020/06/27', '39177'], ['2020/07/16', '49074'], ['2020/10/20', '146801'], ['2020/11/14', '30534'], ['2020/12/03', '36967'], ['2021/02/20', '71190'], ['2021/03/24', '33064'], ['2021/05/11', '65209'], ['2021/06/27', '37799'], ['2021/08/06', '90286'], ['2021/10/26', '81752']]

                },
                {
                    name:'1717608',
                    type:'line',
                    data:[['2020/01/13', '33268'], ['2020/03/06', '40606'], ['2020/04/20', '29555'], ['2020/05/10', '32715'], ['2020/06/23', '39378'], ['2020/07/09', '57847'], ['2020/10/06', '160080'], ['2020/11/19', '28983'], ['2020/12/07', '30838'], ['2021/02/27', '57331'], ['2021/03/28', '30942'], ['2021/04/06', '29904'], ['2021/07/03', '150717'], ['2021/08/25', '53228'], ['2021/10/02', '98395']]

                },
                {
                    name:'1703876',
                    type:'line',
                    data:[['2020/03/28', '99909'], ['2020/04/28', '42697'], ['2020/05/24', '49414'], ['2020/07/21', '153166'], ['2020/09/08', '148241'], ['2020/10/14', '83909'], ['2020/11/02', '36498'], ['2021/01/24', '78235'], ['2021/04/16', '100373'], ['2021/05/22', '54458'], ['2021/06/28', '63843'], ['2021/08/30', '154410'], ['2021/09/21', '74541'], ['2021/10/05', '53355']]

                }
            ]
        };


        myChart.setOption(option);
    }
    //echart_3前五排名
    function echart_31() {
        // 基于准备好的dom，初始化echarts实例
        var myChart = echarts.init(document.getElementById('chart_3'));
        myChart.clear();
        option = {
            title: {
                text: ''
            },
            tooltip: {
                trigger: 'axis',
                formatter: " {a}号用户：</br>{c}"
            },
            legend: {
                // data:['019716', '011309', '007730', '004120', '012163'],
                data:['1720094', '1700206', '1711902', '1717608', '1703876'],
                textStyle:{
                    color: '#fff'
                },
                top: '10%'
            },
            grid: {
                top: '35%',
                left: '3%',
                right: '4%',
                bottom: '8%',
                containLabel: true
            },
            color: ['#FF4949','#FFA74D','#FFEA51','#4BF0FF','#44AFF0','#4E82FF','#584BFF','#BE4DFF','#F845F1'],
            xAxis: {
                type: 'time',
                boundaryGap: false,
                splitLine: {
                    show: false
                },
                axisLine: {
                    lineStyle: {
                        color: '#fff'
                    }
                }
            },
            yAxis: {
                name: '元',
                type: 'value',
                splitLine: {
                    show: false
                },
                axisLine: {
                    lineStyle: {
                        color: '#fff'
                    }
                }
            },
            series: [
                {
                    // data:['019716', '011309', '007730', '004120', '012163'],
                    //data:['1720094', '1700206', '1711902', '1717608', '1703876'],
                    name:'1720094',
                    type:'line',
                    data:[['2020/01/27', '64372'], ['2020/02/24', '83080'], ['2020/03/02', '74272'], ['2020/04/08', '69201'], ['2020/07/05', '244199'], ['2020/08/15', '125156'], ['2020/11/29', '295300'], ['2020/12/24', '77408'], ['2021/01/23', '97585'], ['2021/03/09', '166131'], ['2021/04/30', '73070'], ['2021/06/28', '192954'], ['2021/08/12', '273431'], ['2021/10/24', '212287']]
                },
                {
                    name:'1700206',
                    type:'line',
                    data:[['2020/02/17', '112313'], ['2020/04/12', '53151'], ['2020/05/13', '74670'], ['2020/07/27', '277413'], ['2020/08/30', '104557'], ['2020/09/03', '89502'], ['2020/12/08', '319992'], ['2021/02/18', '110334'], ['2021/05/11', '281082'], ['2021/06/19', '123450'], ['2021/07/19', '69627'], ['2021/09/20', '87688'], ['2021/10/14', '111116'], ['2021/11/29', '76693']]

                },
                {
                    name:'1711902',
                    type:'line',
                    data:[['2020/02/15', '81266'], ['2020/04/21', '76594'], ['2020/05/27', '33407'], ['2020/06/27', '39177'], ['2020/07/16', '49074'], ['2020/10/20', '146801'], ['2020/11/14', '30534'], ['2020/12/03', '36967'], ['2021/02/20', '71190'], ['2021/03/24', '33064'], ['2021/05/11', '65209'], ['2021/06/27', '37799'], ['2021/08/06', '90286'], ['2021/10/26', '81752']]

                },
                {
                    name:'1717608',
                    type:'line',
                    data:[['2020/01/13', '33268'], ['2020/03/06', '40606'], ['2020/04/20', '29555'], ['2020/05/10', '32715'], ['2020/06/23', '39378'], ['2020/07/09', '57847'], ['2020/10/06', '160080'], ['2020/11/19', '28983'], ['2020/12/07', '30838'], ['2021/02/27', '57331'], ['2021/03/28', '30942'], ['2021/04/06', '29904'], ['2021/07/03', '150717'], ['2021/08/25', '53228'], ['2021/10/02', '98395']]

                },
                {
                    name:'1703876',
                    type:'line',
                    data:[['2020/03/28', '99909'], ['2020/04/28', '42697'], ['2020/05/24', '49414'], ['2020/07/21', '153166'], ['2020/09/08', '148241'], ['2020/10/14', '83909'], ['2020/11/02', '36498'], ['2021/01/24', '78235'], ['2021/04/16', '100373'], ['2021/05/22', '54458'], ['2021/06/28', '63843'], ['2021/08/30', '154410'], ['2021/09/21', '74541'], ['2021/10/05', '53355']]

                }
            ]
        };
        myChart.setOption(option);
    }

});
